## Plan Result (staging-staging)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 10 to add, 0 to change, 10 to destroy.</code></pre>

* Replace
  * module.casetracker.azurerm_role_assignment.dnszonecontributer
  * module.certificatedbailiffs.azurerm_role_assignment.dnszonecontributer
  * module.courtfines.azurerm_role_assignment.dnszonecontributer
  * module.hearings.azurerm_role_assignment.dnszonecontributer
  * module.hearings-reform.azurerm_role_assignment.dnszonecontributer
  * module.immigrationappealsonline.azurerm_role_assignment.dnszonecontributer
  * module.public-dns.azurerm_role_assignment.dnszonecontributer
  * module.staging.azurerm_role_assignment.dnszonecontributer
  * module.staging-internal.azurerm_role_assignment.dnszonecontributer
  * module.tribunalsdecisions.azurerm_role_assignment.dnszonecontributer




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.casetracker.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/staging.casetracker.justice.gov.uk/providers/Microsoft.Authorization/roleAssignments/b25955d9-8fcf-6dd0-3e1b-743ac5371a45" -> (known after apply)
      ~ name                             = "b25955d9-8fcf-6dd0-3e1b-743ac5371a45" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      ~ scope                            = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/staging.casetracker.justice.gov.uk" -> "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/staging.casetracker.justice.gov.uk" # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.certificatedbailiffs.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/staging.certificatedbailiffs.justice.gov.uk/providers/Microsoft.Authorization/roleAssignments/eee41e16-4130-9585-fc5d-b72482d20b32" -> (known after apply)
      ~ name                             = "eee41e16-4130-9585-fc5d-b72482d20b32" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      ~ scope                            = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/staging.certificatedbailiffs.justice.gov.uk" -> "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/staging.certificatedbailiffs.justice.gov.uk" # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.courtfines.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/staging.courtfines.direct.gov.uk/providers/Microsoft.Authorization/roleAssignments/e09ba869-09ac-a49d-96b1-ac6b8c102868" -> (known after apply)
      ~ name                             = "e09ba869-09ac-a49d-96b1-ac6b8c102868" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      ~ scope                            = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/staging.courtfines.direct.gov.uk" -> "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/staging.courtfines.direct.gov.uk" # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.hearings.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/staging.hearings.hmcts.net/providers/Microsoft.Authorization/roleAssignments/a6e2ca89-49cd-d9d9-22af-07c421a7eebb" -> (known after apply)
      ~ name                             = "a6e2ca89-49cd-d9d9-22af-07c421a7eebb" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      ~ scope                            = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/staging.hearings.hmcts.net" -> "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/staging.hearings.hmcts.net" # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.hearings-reform.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/staging.hearings.reform.hmcts.net/providers/Microsoft.Authorization/roleAssignments/db3041d8-0009-edfc-40c5-4ed3b3b3cf19" -> (known after apply)
      ~ name                             = "db3041d8-0009-edfc-40c5-4ed3b3b3cf19" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      ~ scope                            = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/staging.hearings.reform.hmcts.net" -> "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/staging.hearings.reform.hmcts.net" # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.immigrationappealsonline.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/staging.immigrationappealsonline.justice.gov.uk/providers/Microsoft.Authorization/roleAssignments/76e2be3a-93d1-c95e-4274-14a570419fa1" -> (known after apply)
      ~ name                             = "76e2be3a-93d1-c95e-4274-14a570419fa1" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      ~ scope                            = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/staging.immigrationappealsonline.justice.gov.uk" -> "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/staging.immigrationappealsonline.justice.gov.uk" # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.public-dns.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/aat.platform.hmcts.net/providers/Microsoft.Authorization/roleAssignments/e7818858-facf-e5f8-b1e0-43e1fe0d2e83" -> (known after apply)
      ~ name                             = "e7818858-facf-e5f8-b1e0-43e1fe0d2e83" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      ~ scope                            = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/aat.platform.hmcts.net" -> "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/aat.platform.hmcts.net" # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.staging.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/staging.platform.hmcts.net/providers/Microsoft.Authorization/roleAssignments/e093476a-fc3e-cafb-a88b-dac6f471ae3c" -> (known after apply)
      ~ name                             = "e093476a-fc3e-cafb-a88b-dac6f471ae3c" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      ~ scope                            = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/staging.platform.hmcts.net" -> "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/staging.platform.hmcts.net" # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.staging-internal.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/staging.internal.hmcts.net/providers/Microsoft.Authorization/roleAssignments/86096fe1-d8dd-4365-f931-eedbb0e6423e" -> (known after apply)
      ~ name                             = "86096fe1-d8dd-4365-f931-eedbb0e6423e" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      ~ scope                            = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/staging.internal.hmcts.net" -> "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/staging.internal.hmcts.net" # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.tribunalsdecisions.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/staging.tribunalsdecisions.service.gov.uk/providers/Microsoft.Authorization/roleAssignments/558fac70-51e3-455c-4bf8-431e335f7f38" -> (known after apply)
      ~ name                             = "558fac70-51e3-455c-4bf8-431e335f7f38" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      ~ scope                            = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/staging.tribunalsdecisions.service.gov.uk" -> "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/staging.tribunalsdecisions.service.gov.uk" # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 10 to add, 0 to change, 10 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1175,"Program":"tfcmt","SHA1":"","Target":"staging-staging","Vars":{}} -->